const resultProfiles = {
  WQNL: {
    name: "我求你了",
    code: "WQNL",
    summary: "恭喜这位NEX2Y，测出了大阪特产【WQNL-我求你了】人格。你的抽象天赋与井上小春不分伯仲，想必是会为了随地大小疯而苦练breaking的狠角色。当你出现在任何场合，空气总因你清奇的脑回路而扭曲，甫一开口便是平地惊雷；事实上你不需要做什么，你的存在本身，就是一种让人想要求你的力量。"
  },
  RTH: {
    name: "策马者",
    code: "RTH",
    summary: "恭喜这位NEX2Y，测出了全团最像 TOMOYA 的【RTH-策马者】人格。RTH全称Ride-the-Horse，是MYP二把手的有力竞争者。你的领导力和执行力都很强，敢拍板也能扛责任。你擅长在复杂情境中整合资源，带人冲破难关，是天然的核心位。期待你和磨牙带领MYP首个男团NXEZ登顶的那一天！"
  },
  EEEE: {
    name: "社交恐怖分子",
    code: "EEEE",
    summary: "恭喜这位NEX2Y，测出了让哥line兴奋不已，让弟line闻风丧胆的【EEEE-社交恐怖分子】人格。你社交雷达拉满，能快速与陌生人建立连接，在哪里都是焦点，完全是在社交场里横着走的终极社牛玩家。或许你愿意来“内向z成长企划”担任导师吗？"
  },
  MAJIA: {
    name: "马甲马甲",
    code: "맞아맞아",
    summary: "恭喜这位NEX2Y，测出了直击恋哥癖心巴的【맞아맞아-马甲马甲】人格。谁不想一回家就能吃上YU做的饭菜，谁不想摔倒后被YU扶起来获得一张帅脸和一句“肯恰那？”。而我的朋友，你就是那个“YU”，背包里除了泡面之外还有满满的爱。你的存在让人如沐春风，有你在，很安心。"
  },
  MIRACLE: {
    name: "奇迹汪汪鼠",
    code: "MIRACLE",
    summary: "恭喜这位NEX2Y，测出了【MIRACLE-奇迹汪汪鼠】人格。看似内敛的你，其实藏着Pro的一面。你和HYUI一样目标明确，不懈奋斗直到站上属于你的舞台；你和SO GEON一样坚韧不拔，就算从零开始也能逆风翻盘。人狠话不多是最恰当的形容词，经常闷声干大事，是团队里非常重要的存在。"
  },
  FOREST: {
    name: "森林之子",
    code: "FOREST",
    summary: "恭喜这位NEX2Y，测出了森系小精灵【FOREST-森林之子】人格。你内敛又温和，像森林，像海洋。你和seita一样具有稳定的内核，在你身边能感受到平静与包容的力量；不知你可曾与大树拥抱？想必比起身处人群中心，你会更喜欢被大自然的静谧包裹，享受独处时光。"
  },
  QUEEN: {
    name: "女王陛下",
    code: "QUEEN",
    summary: "恭喜这位NEX2Y，解锁稀有属性【QUEEN-女王陛下】人格。你低调内敛却金句频出，不鸣则已，一鸣惊人。你是否也觉得，如果世界没有观众，每条道路都是本王的T台？活跃的内心世界与表面的沉默镇静形成强烈反差，也是你的高光所在。女王陛下，让我拜倒在您的石榴裙下吧！"
  },
  O_RLY: {
    name: "综艺之神",
    code: "O-RLY",
    summary: "恭喜这位NEX2Y，测出了CPU时常过载的【O-RLY-综艺之神】人格。从来无需研究游戏规则，因为研究了也没用，总是等到结果揭晓那一刻才一键开机“진짜요？！”。慢半拍的天然萌和真实反应总能制造名场面。温馨提示，如果没有大悠哥的绝对力量，请不要轻易对他人放下警惕。参考文献：【REAL NEXZ】EP.34&35 拜托钱包。"
  },
  MAFIA: {
    name: "暗面策士",
    code: "MAFIA",
    summary: "恭喜这位NEX2Y，测出了二丫界的天选黑手党【MAFIA-暗面策士】人格。当别人还在参与，你已经在分析；当局势还在展开，你已经看到走向。机智而敏锐，只需发动聪明的大脑，便轻易将他人玩弄于股掌之间。"
  },
  AJEOSSI: {
    name: "冷梗先知",
    code: "아저씨",
    summary: "恭喜这位NEX2Y，测出了【아저씨-冷梗先知】人格，乃是老梗研究室副室长有力候选人。你善于观察，思深忧远，有着超乎同龄人的深沉，就连造梗也是如此超前。哪怕成功率成谜，也从不停止输出：懂我的人，自然会笑；不懂的人，笑不笑无所谓！"
  },
  HAHA: {
    name: "低空缺氧",
    code: "HAHA",
    summary: "恭喜这位NEX2Y，测出了牙齿很凉快的【HAHA-低空缺氧】人格。你的感应太灵敏，笑点面前只需0.0001s就会破功。敢问英雄是否曾为了保持严肃而以头抢地？温馨提示，请不要在吃饭的时候看真呐，会有窒息风险！"
  }
};

module.exports = {
  resultProfiles
};
